// ** ডিবাগ চেকলিস্ট 

১.console tab utilities API লিখে গুগলে সার্চ দাও। তারপরেও সেই সার্চ রেজাল্টে গিয়ে ৩০-৪৫ মিনিট ধরে ধরে যা যা আছে সেগুলা পড়ো। 

২.কিভাবে বুঝবে একটা বাটনে কোন একটা ইভেন্ট হ্যান্ডলার যোগ করা আছে কিনা? সেটা ডেভ টুল এর কোন কোন জায়গায় দেখা যায়। চিন্তা করে বা ডেভ টুল খুলে বের করার চেষ্টা করো। 

৩.কিভাবে তুমি console ট্যাব-এর মধ্যে কোন একটা ফাংশনকে কল করে সেই ফাংশনের প্রথম লাইনে কোড ব্রেক করে ফেলবে। অর্থাৎ সেখানে গেলে কোড অটোমেটিক বন্ধ হয়ে যাবে।ক্লিক করে কোন ব্রেক পয়েন্ট যোগ করা লাগবে না?

৪. একটা কন্ডিশনাল ব্রেক পয়েন্ট সেট করতে হয় কিভাবে? সেটা নিজে নিজে সেট করে ফেলো 

৫. accessibility কি জিনিস?

৬. call stack কি জিনিস? দরকার হলে গুগলে সার্চ দিয়ে শেখার চেষ্টা করো। 

৭. Regular এক্সপ্রেশন কি জিনিস এইটা কি কাজে লাগে?

// ** regular expression's are patterns of strings used to match,replca,validate strings combinations in a programme

৮. Lighthouse ট্যাব দিয়ে কি করে?

-------------

টাস্ক-১:

৯. আমাদের গিটহাব এ issue-tracker নামে একটা রিপোজিটরি আছে।সেখানে কোন একটা issue যোগ করার পর সেটাকে close করা যায়না। আবার ডিলিট ও করা যায় না। তো তোমার কাজ হচ্ছে সেই সাইটের বাগ ফিক্স করা। এই ছাড়া আরো ইস্যু আছে কি নাই। সেটা আমি বলে দিচ্ছি না। তোমার কাজ হচ্ছে ওয়েবসাইট ঘেঁটেঘুটে দেখা। কি কি কাজ করার কথা সেটা ঠিক মতো কাজ করতেছে কিনা। এতে অপরিচিত ওয়েবসাইট ঘাটতে তোমার কিছু অভিজ্ঞতা হবে। তারপর দেখো সেখানে কোন ইস্যু থাকতে পারে কিনা। থাকলে সেগুলা ফিক্স করার চেষ্টা করো। 







------------

টাস্ক-২:

[ এক্সট্রা হোম ওয়ার্ক ] [ আজকে না পারলে আগামীকাল করবে] 

১১. আমাদের গিটহাব এ যাও। সেখানে broken-phone নামে একটা রিপোজটিরি আছে। সেটা ক্লোন করো। 

১৩. সেখানেও কী কী বাগ আছে। তুমি নিজেই খুঁজে বের করার চেষ্টা করো। মিনিমাম তিনটা বাগ খুঁজে বের করে সেগুলা ফিক্স করার চেষ্টা করো। আরো বেশি বাগ আছে কিনা খুঁজে বের করো। 

